# SetTransparency Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectContext3DHandleSettings..::..SetTransparency Method
DirectContext3DHandleSettings Class See Also
---
Sets the transparency value of the handle and the associated DirectContext3D graphics.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public void SetTransparency(
	int transparency
)
```

Visual Basic
---
```text
Public Sub SetTransparency ( _
	transparency As Integer _
)
```

Visual C++
---
```text
public:
void SetTransparency(
	int transparency
)
```

# ### Parameters
transparency
    Type: System..::..Int32 The transparency value to apply (in percentage)
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The value is invalid. The valid range is 0 through 100 |

# See Also
DirectContext3DHandleSettings Class
Autodesk.Revit.DB.DirectContext3D Namespace